p3/README.org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
  <head>
    <title>README.org</title>
<meta name="generator" content="emacs 26.3; htmlfontify 0.21" />

  </head>
  <body onload="stripe('index'); return true;">

<pre><span class="org-document-info-keyword" id="nil-1">#+TITLE:</span> <span class="org-document-title" id="nil-10">P3 50pts
</span><span class="org-document-info-keyword" id="nil-19">#+AUTHOR:</span> <span class="org-document-info" id="nil-29">joeymazzarelli@boisestate.edu
</span>
<span class="org-level-1" id="nil-60">*</span><span class="org-level-1" id="nil-61"> </span><span class="org-level-1" id="nil-62">1. Assignment Details
</span><span class="org-hide" id="nil-84">*</span><span class="org-level-2" id="nil-85">*</span><span class="org-level-2" id="nil-86"> </span><span class="org-level-2" id="nil-87">Autoloading
</span>PHP includes a feature that allows the developer to dynamically incude a source
code file when a class is not yet defined. See <span class="org-link" id="nil-226">https://php.net/spl_autoload_registe</span><span class="org-link" id="nil-262">r</span>

The file <span onclick="toggle_invis('invisible-274-276');">…</span><span class="org-link" id="invisible-274-276-274">[</span><span class="org-link" id="invisible-274-276-275">[</span><span class="org-link" id="nil-276">file:./1-autoload/main.p</span><span class="org-link" id="nil-300">hp</span><span onclick="toggle_invis('invisible-302-304');">…</span><span class="org-link" id="invisible-302-304-302">]</span><span class="org-link" id="invisible-302-304-303">]</span> is set up to use such an autoloader. The
function for autoloading is in <span onclick="toggle_invis('invisible-377-379');">…</span><span class="org-link" id="invisible-377-379-377">[</span><span class="org-link" id="invisible-377-379-378">[</span><span class="org-link" id="nil-379">file:./1-autoload/autoload.ph</span><span class="org-link" id="nil-408">p</span><span onclick="toggle_invis('invisible-409-411');">…</span><span class="org-link" id="invisible-409-411-409">]</span><span class="org-link" id="invisible-409-411-410">]</span>, but is incomplete.

When completed, the PHP script should automatically find and include the correct
source code file. Running main, <span class="org-code" id="nil-546">~php 1-autoload/main.php~</span> ought to display an elephant.

If for some reason, thre is no source code file for the class being
instantiated, the autoloader should throw an Exception with the message:
<span class="org-verbatim" id="nil-744">=Expected to find: &lt;$path&gt; for: &lt;$class&gt;=</span> where <span class="org-code" id="nil-792">~$path~</span> is the relative path from
the autoloader file, and $class is the of the <span class="org-code" id="nil-872">~$class~</span> being loaded.

Also, the file <span onclick="toggle_invis('invisible-911-913');">…</span><span class="org-link" id="invisible-911-913-911">[</span><span class="org-link" id="invisible-911-913-912">[</span><span class="org-link" id="nil-913">file:./1-autoload/languages/php/mascot.ph</span><span class="org-link" id="nil-954">p</span><span onclick="toggle_invis('invisible-955-957');">…</span><span class="org-link" id="invisible-955-957-955">]</span><span class="org-link" id="invisible-955-957-956">]</span> is missing a magic method
for printing the Mascot object as a string.

<span class="org-hide" id="nil-1029">*</span><span class="org-hide" id="nil-1030">*</span><span class="org-level-3" id="nil-1031">*</span><span class="org-level-3" id="nil-1032"> </span><span class="org-level-3" id="nil-1033">Requirements
</span><span class="org-hide" id="nil-1046">*</span><span class="org-hide" id="nil-1047">*</span><span class="org-hide" id="nil-1048">*</span><span class="org-level-4" id="nil-1049">*</span><span class="org-level-4" id="nil-1050"> </span><span class="org-level-4" id="nil-1051">1.1 (15pts) Complete the auto-loading function in </span><span onclick="toggle_invis('invisible-1101-1103');">…</span><span class="org-link" id="invisible-1101-1103-1101">[</span><span class="org-link" id="invisible-1101-1103-1102">[</span><span class="org-link" id="nil-1103">file:./1-autoload/autoload.ph</span><span class="org-link" id="nil-1132">p</span><span onclick="toggle_invis('invisible-1133-1135');">…</span><span class="org-link" id="invisible-1133-1135-1133">]</span><span class="org-link" id="invisible-1133-1135-1134">]</span><span class="org-level-4" id="nil-1135">
</span><span class="org-hide" id="nil-1136">*</span><span class="org-hide" id="nil-1137">*</span><span class="org-hide" id="nil-1138">*</span><span class="org-hide" id="nil-1139">*</span><span class="org-level-5" id="nil-1140">*</span><span class="org-level-5" id="nil-1141"> </span><span class="org-level-5" id="nil-1142">1.1.1 Filenames should </span><span class="underline" id="nil-1165">_always_</span><span class="org-level-5" id="nil-1173"> be lowercase
</span>Assume all file names are in lowercase.
<span class="org-hide" id="nil-1227">*</span><span class="org-hide" id="nil-1228">*</span><span class="org-hide" id="nil-1229">*</span><span class="org-hide" id="nil-1230">*</span><span class="org-level-5" id="nil-1231">*</span><span class="org-level-5" id="nil-1232"> </span><span class="org-level-5" id="nil-1233">1.1.2 It should work on Windows and Linux (see </span><span class="org-link" id="nil-1280">https://www.php.net/manual/en/dir.constants.ph</span><span class="org-link" id="nil-1326">p</span><span class="org-level-5" id="nil-1327">)
</span>See the &quot;directory separator&quot; constant.
<span class="org-hide" id="nil-1369">*</span><span class="org-hide" id="nil-1370">*</span><span class="org-hide" id="nil-1371">*</span><span class="org-hide" id="nil-1372">*</span><span class="org-level-5" id="nil-1373">*</span><span class="org-level-5" id="nil-1374"> </span><span class="org-level-5" id="nil-1375">1.1.3 It should throw an exception when it cannot find the source code.
</span>The exception should say: &quot;Expected to find: &lt;$path&gt; for: &lt;$class&gt;&quot;
<span class="org-hide" id="nil-1515">*</span><span class="org-hide" id="nil-1516">*</span><span class="org-hide" id="nil-1517">*</span><span class="org-level-4" id="nil-1518">*</span><span class="org-level-4" id="nil-1519"> </span><span class="org-level-4" id="nil-1520">1.2 (5pts) Add a &quot;to string&quot; method to the Mascot class so the elephant is printed to screen.
</span>
<span class="org-hide" id="nil-1615">*</span><span class="org-level-2" id="nil-1616">*</span><span class="org-level-2" id="nil-1617"> </span><span class="org-level-2" id="nil-1618">Arrays and Objects
</span>Consider the following code:
<span class="org-block-begin-line" id="nil-1666">#+BEGIN_SRC php
</span><span class="php-variable-sigil" id="nil-1682">$</span><span class="php-variable-name" id="nil-1683">users</span><span class="org-block" id="nil-1688"> = [
</span><span class="org-block" id="nil-1693">    </span><span class="php-keyword" id="nil-1697">new</span><span class="org-block" id="nil-1700"> </span><span class="type" id="nil-1701">User</span><span class="org-block" id="nil-1705">(</span><span class="php-string" id="nil-1706">'don@joe.com'</span><span class="org-block" id="nil-1719">),
</span><span class="org-block" id="nil-1722">    </span><span class="php-keyword" id="nil-1726">new</span><span class="org-block" id="nil-1729"> </span><span class="type" id="nil-1730">User</span><span class="org-block" id="nil-1734">(</span><span class="php-string" id="nil-1735">'jane@doe.com'</span><span class="org-block" id="nil-1749">),
</span><span class="org-block" id="nil-1752">];
</span><span class="org-block" id="nil-1755">
</span><span class="php-variable-sigil" id="nil-1756">$</span><span class="php-variable-name" id="nil-1757">activity</span><span class="org-block" id="nil-1765"> = [
</span><span class="org-block" id="nil-1770">    </span><span class="php-string" id="nil-1774">&quot;don@joe.com&quot;</span><span class="org-block" id="nil-1787"> =&gt; </span><span class="org-block" id="nil-1791">[</span><span class="org-block" id="nil-1792">[</span><span class="highlight-numbers-number" id="nil-1793">22</span><span class="org-block" id="nil-1795">,</span><span class="highlight-numbers-number" id="nil-1796">3</span><span class="org-block" id="nil-1797">], [</span><span class="highlight-numbers-number" id="nil-1801">28</span><span class="org-block" id="nil-1803">,</span><span class="highlight-numbers-number" id="nil-1804">2</span><span class="org-block" id="nil-1805">], [</span><span class="highlight-numbers-number" id="nil-1809">17</span><span class="org-block" id="nil-1811">, </span><span class="highlight-numbers-number" id="nil-1813">3</span><span class="org-block" id="nil-1814">]</span><span class="org-block" id="nil-1815">]</span><span class="org-block" id="nil-1816">,
</span><span class="org-block" id="nil-1818">    </span><span class="php-string" id="nil-1822">&quot;jane@doe.com&quot;</span><span class="org-block" id="nil-1836"> =&gt; </span><span class="org-block" id="nil-1840">[</span><span class="org-block" id="nil-1841">[</span><span class="highlight-numbers-number" id="nil-1842">23</span><span class="org-block" id="nil-1844">,</span><span class="highlight-numbers-number" id="nil-1845">4</span><span class="org-block" id="nil-1846">], [</span><span class="highlight-numbers-number" id="nil-1850">36</span><span class="org-block" id="nil-1852">,</span><span class="highlight-numbers-number" id="nil-1853">5</span><span class="org-block" id="nil-1854">], [</span><span class="highlight-numbers-number" id="nil-1858">23</span><span class="org-block" id="nil-1860">, </span><span class="highlight-numbers-number" id="nil-1862">2</span><span class="org-block" id="nil-1863">]</span><span class="org-block" id="nil-1864">]</span><span class="org-block" id="nil-1865">,
</span><span class="org-block" id="nil-1867">    </span><span class="php-string" id="nil-1871">&quot;every@example.com&quot;</span><span class="org-block" id="nil-1890"> =&gt; </span><span class="org-block" id="nil-1894">[</span><span class="org-block" id="nil-1895">[</span><span class="highlight-numbers-number" id="nil-1896">31</span><span class="org-block" id="nil-1898">,</span><span class="highlight-numbers-number" id="nil-1899">2</span><span class="org-block" id="nil-1900">], [</span><span class="highlight-numbers-number" id="nil-1904">29</span><span class="org-block" id="nil-1906">,</span><span class="highlight-numbers-number" id="nil-1907">5</span><span class="org-block" id="nil-1908">], [</span><span class="highlight-numbers-number" id="nil-1912">21</span><span class="org-block" id="nil-1914">, </span><span class="highlight-numbers-number" id="nil-1916">0</span><span class="org-block" id="nil-1917">]</span><span class="org-block" id="nil-1918">]</span><span class="org-block" id="nil-1919">,
</span><span class="org-block" id="nil-1921">];
</span><span class="org-block-end-line" id="nil-1924">#+END_SRC</span><span class="org-block-end-line" id="nil-1933">
</span>
The first variable, <span class="org-code" id="nil-1955">~$users~</span>, contains the valid list of users.

The second variable, <span class="org-code" id="nil-2021">~$activity~</span>, contains a data sequence for all users, even
invalid ones. In this example, <span class="org-verbatim" id="nil-2110">=every@example.com=</span> would be considered &quot;invalid&quot;.

The sequence of data represents &quot;impressions&quot; and &quot;clicks&quot; for a series of days.
In this example <span class="org-verbatim" id="nil-2259">=don@joe.com=</span> had 22 impressions and 3 clicks on the first day,
28 impressions and 2 clicks for day 2, and 17 impressions and 3 clicks for the
last day. And so on for the other users.

In <span onclick="toggle_invis('invisible-2447-2449');">…</span><span class="org-link" id="invisible-2447-2449-2447">[</span><span class="org-link" id="invisible-2447-2449-2448">[</span><span class="org-link" id="nil-2449">file:./2-rolling-average/lib.ph</span><span class="org-link" id="nil-2480">p</span><span onclick="toggle_invis('invisible-2481-2483');">…</span><span class="org-link" id="invisible-2481-2483-2481">]</span><span class="org-link" id="invisible-2481-2483-2482">]</span>, there is a function named
<span class="org-code" id="nil-2511">~rolling_averages~</span>. This function must calculate a 2-day rolling average. The
first two days (i=0,1) are averaged by summing their parts, and calculating the average.
Then the same formula is provided to the second two days (i=1,2). And so on.

For a given list of clicks and impressions of length N, there will end up being
N-1 averages in the resulting array.

The average to calculate is the &quot;click-through rate&quot;, which is clicks divided by
impressions. If there are 2 impressions, and 1 click, that is a 0.50
click-through rate. Only valid users, as defined above, should be included in the results.

The format of the result should be an array indexed by the email, with a list of
rolling averages. The averages must be rounded to two decimal points.

Rolling average results for the data above:
<span class="org-block-begin-line" id="nil-3312">#+BEGIN_SRC text
</span><span class="org-block" id="nil-3329">Array
</span><span class="org-block" id="nil-3335">(
</span><span class="org-block" id="nil-3337">    [don@joe.com] =&gt; Array
</span><span class="org-block" id="nil-3364">        (
</span><span class="org-block" id="nil-3374">            [0] =&gt; 0.10
</span><span class="org-block" id="nil-3398">            [1] =&gt; 0.11
</span><span class="org-block" id="nil-3422">        )
</span><span class="org-block" id="nil-3432">
</span><span class="org-block" id="nil-3433">    [jane@doe.com] =&gt; Array
</span><span class="org-block" id="nil-3461">        (
</span><span class="org-block" id="nil-3471">            [0] =&gt; 0.15
</span><span class="org-block" id="nil-3495">            [1] =&gt; 0.12
</span><span class="org-block" id="nil-3519">        )
</span><span class="org-block" id="nil-3529">)
</span><span class="org-block-end-line" id="nil-3531">#+END_SRC</span><span class="org-block-end-line" id="nil-3540">
</span>
<span class="org-hide" id="nil-3542">*</span><span class="org-hide" id="nil-3543">*</span><span class="org-level-3" id="nil-3544">*</span><span class="org-level-3" id="nil-3545"> </span><span class="org-level-3" id="nil-3546">Requirements
</span><span class="org-hide" id="nil-3559">*</span><span class="org-hide" id="nil-3560">*</span><span class="org-hide" id="nil-3561">*</span><span class="org-level-4" id="nil-3562">*</span><span class="org-level-4" id="nil-3563"> </span><span class="org-level-4" id="nil-3564">2.1 (15pts) Implement the </span><span class="org-verbatim" id="nil-3590">=rolling_averages()=</span><span class="org-level-4" id="nil-3610"> function in </span><span onclick="toggle_invis('invisible-3623-3625');">…</span><span class="org-link" id="invisible-3623-3625-3623">[</span><span class="org-link" id="invisible-3623-3625-3624">[</span><span class="org-link" id="nil-3625">file:./2-rolling-average/lib.ph</span><span class="org-link" id="nil-3656">p</span><span onclick="toggle_invis('invisible-3657-3659');">…</span><span class="org-link" id="invisible-3657-3659-3657">]</span><span class="org-link" id="invisible-3657-3659-3658">]</span><span class="org-level-4" id="nil-3659">
</span>
<span class="org-hide" id="nil-3661">*</span><span class="org-level-2" id="nil-3662">*</span><span class="org-level-2" id="nil-3663"> </span><span class="org-level-2" id="nil-3664">Searching
</span>In <span onclick="toggle_invis('invisible-3677-3679');">…</span><span class="org-link" id="invisible-3677-3679-3677">[</span><span class="org-link" id="invisible-3677-3679-3678">[</span><span class="org-link" id="nil-3679">file:./3-searching/data.cs</span><span class="org-link" id="nil-3705">v</span><span onclick="toggle_invis('invisible-3706-3708');">…</span><span class="org-link" id="invisible-3706-3708-3706">]</span><span class="org-link" id="invisible-3706-3708-3707">]</span>, there is a directory of sorts. It contains an
ID, a name and email, and some miscellaneous text. Pass the path to this file,
along with a search term, into the function <span class="org-verbatim" id="nil-3879">=search_directory=</span> found in <span onclick="toggle_invis('invisible-3907-3909');">…</span><span class="org-link" id="invisible-3907-3909-3907">[</span><span class="org-link" id="invisible-3907-3909-3908">[</span><span class="org-link" id="nil-3909">file:./3-searching/lib.ph</span><span class="org-link" id="nil-3934">p</span><span onclick="toggle_invis('invisible-3935-3937');">…</span><span class="org-link" id="invisible-3935-3937-3935">]</span><span class="org-link" id="invisible-3935-3937-3936">]</span>.

<span class="org-block-begin-line" id="nil-3940">#+BEGIN_SRC php
</span><span class="php-variable-sigil" id="nil-3956">$</span><span class="php-variable-name" id="nil-3957">results</span><span class="org-block" id="nil-3964"> = search_directory(</span><span class="php-constant" id="nil-3984">__DIR__</span><span class="org-block" id="nil-3991"> . </span><span class="php-string" id="nil-3994">'/data.csv'</span><span class="org-block" id="nil-4005">, </span><span class="php-string" id="nil-4007">'don'</span><span class="org-block" id="nil-4012">);
</span><span class="org-block" id="nil-4015">print_r(</span><span class="php-variable-sigil" id="nil-4023">$</span><span class="php-variable-name" id="nil-4024">results</span><span class="org-block" id="nil-4031">);
</span><span class="org-block-end-line" id="nil-4034">#+END_SRC</span><span class="org-block-end-line" id="nil-4043">
</span>
The function:
 <span class="org-list-dt" id="nil-4060">-</span> get the contents of the file,
 <span class="org-list-dt" id="nil-4093">-</span> loop over every line,
 <span class="org-list-dt" id="nil-4118">-</span> try to match (case-insensitive) the name or email against the search term
 <span class="org-list-dt" id="nil-4195">-</span> return a list of emails that do match
 <span class="org-list-dt" id="nil-4236">-</span> the miscellaneous text should <span class="underline" id="nil-4268">_not_</span> be searched

This should print:
<span class="org-block-begin-line" id="nil-4306">#+BEGIN_SRC text
</span><span class="org-block" id="nil-4323">Array
</span><span class="org-block" id="nil-4329">(
</span><span class="org-block" id="nil-4331">    [0] =&gt; don@joe.com
</span><span class="org-block" id="nil-4354">)
</span><span class="org-block-end-line" id="nil-4356">#+END_SRC</span><span class="org-block-end-line" id="nil-4365">
</span>
<span class="org-hide" id="nil-4367">*</span><span class="org-hide" id="nil-4368">*</span><span class="org-level-3" id="nil-4369">*</span><span class="org-level-3" id="nil-4370"> </span><span class="org-level-3" id="nil-4371">Requirements
</span><span class="org-hide" id="nil-4384">*</span><span class="org-hide" id="nil-4385">*</span><span class="org-hide" id="nil-4386">*</span><span class="org-level-4" id="nil-4387">*</span><span class="org-level-4" id="nil-4388"> </span><span class="org-level-4" id="nil-4389">3.1 (15pts) Implement the </span><span class="org-verbatim" id="nil-4415">=search_directory()=</span><span class="org-level-4" id="nil-4435"> function in </span><span onclick="toggle_invis('invisible-4448-4450');">…</span><span class="org-link" id="invisible-4448-4450-4448">[</span><span class="org-link" id="invisible-4448-4450-4449">[</span><span class="org-link" id="nil-4450">file:./3-searching/lib.ph</span><span class="org-link" id="nil-4475">p</span><span onclick="toggle_invis('invisible-4476-4478');">…</span><span class="org-link" id="invisible-4476-4478-4476">]</span><span class="org-link" id="invisible-4476-4478-4477">]</span><span class="org-level-4" id="nil-4478">
</span>

<span class="org-level-1" id="nil-4481">*</span><span class="org-level-1" id="nil-4482"> </span><span class="org-level-1" id="nil-4483">2. Due Date &amp; Submission
</span>
<span class="org-hide" id="nil-4509">*</span><span class="org-level-2" id="nil-4510">*</span><span class="org-level-2" id="nil-4511"> </span><span class="org-level-2" id="nil-4512">Tests
</span>Some example tests have been provided in <span onclick="toggle_invis('invisible-4559-4561');">…</span><span class="org-link" id="invisible-4559-4561-4559">[</span><span class="org-link" id="invisible-4559-4561-4560">[</span><span class="org-link" id="nil-4561">file:./test</span><span class="org-link" id="nil-4572">s</span><span onclick="toggle_invis('invisible-4573-4575');">…</span><span class="org-link" id="invisible-4573-4575-4573">]</span><span class="org-link" id="invisible-4573-4575-4574">]</span>

You can run them with PHP. When they succeed, there will be no output.

<span class="org-block-begin-line" id="nil-4649">#+BEGIN_SRC bash
</span><span class="org-block" id="nil-4666">php tests/1-autoload.php
</span><span class="org-block" id="nil-4691">php tests/1-rolling-averages.php
</span><span class="org-block" id="nil-4724">php tests/1-searching.php
</span><span class="org-block-end-line" id="nil-4750">#+END_SRC</span><span class="org-block-end-line" id="nil-4759">
</span>
<span class="org-hide" id="nil-4761">*</span><span class="org-level-2" id="nil-4762">*</span><span class="org-level-2" id="nil-4763"> </span><span class="org-level-2" id="nil-4764">Due Date
</span>The assignment is due by the end of the day (midnight), Monday October 14th.

<span class="org-hide" id="nil-4851">*</span><span class="org-level-2" id="nil-4852">*</span><span class="org-level-2" id="nil-4853"> </span><span class="org-level-2" id="nil-4854">Submission
</span>Complete the requirements above and submit all the files in this directory,
including the tests.

From the directory containing your work, run the <span class="org-verbatim" id="nil-5012">=submit=</span> command from <span class="org-verbatim" id="nil-5034">=onyx=</span>.

<span class="org-verbatim" id="nil-5043">=submit joeymazzarelli cs401 p3=</span>

This command will pick up all files in the current directory (as well as any
subdirectories recursively) and time-stamp them before transferring the combined
files to the instructor’s account.
</pre>

 </body>
</html>
